genestealer/everblu-meters-esp8266-improved/src/main.cpp
  Serial.printf("Data from meter:\n");
  Serial.printf("Liters : %d\nBattery (in months) : %d\nCounter : %d\nRSSI : %d\nTime start : %s\nTime end : %s\n\n", meter_data.liters, meter_data.battery_left, meter_data.reads_counter, meter_data.rssi, timeStartFormatted, timeEndFormatted);
  Serial.printf("RSSI (dBm) : %d\n", meter_data.rssi_dbm);
  Serial.printf("RSSI (percentage) : %d\n", calculateMeterdBmToPercentage(meter_data.rssi_dbm));
  Serial.printf("Signal quality (LQI) : %d\n", meter_data.lqi);
  Serial.printf("Signal quality (LQI percentage) : %d\n", calculateLQIToPercentage(meter_data.lqi));

  // Publish meter data to MQTT (using char buffers instead of String)
  char valueBuffer[32];

  snprintf(valueBuffer, sizeof(valueBuffer), "%d", meter_data.liters);
  mqtt.publish(String(MQTT_BASE_TOPIC) + "liters", valueBuffer, true);
  delay(5);

  // Publish historical data as JSON attributes for Home Assistant
  // This provides 13 months of historical volume readings that can be accessed as attributes
  // in Home Assistant. Each value represents the total volume at the end of that month.
  // The meter stores these internally with timestamps, but the RADIAN protocol only
  // returns the volume values without dates.
  int num_history = 0;
  if (meter_data.history_available)
  {
    // Count valid historical values (non-zero)
    for (int i = 0; i < 13; i++)
    {
      if (meter_data.history[i] == 0)
        break;
      num_history++;
    }

    // If the history block was marked available but contained no
    // non‑zero entries, treat it as unavailable for this frame.
    if (num_history == 0)
    {
      Serial.println("WARN: history_available=true but no non-zero history entries found - skipping history publish for this frame");
      meter_data.history_available = false;
    }
  }

  if (meter_data.history_available)
  {

    Serial.printf("\n=== Historical Data (%d months) ===\n", num_history);
    Serial.println("Month  Volume (L)  Usage (L)");
    Serial.println("-----  ----------  ---------");

    // Calculate monthly consumption from the historical data
    // Format: {"history": [oldest_volume, ..., newest_volume], "monthly_usage": [month1_usage, ..., month13_usage]}
    // The attributes JSON can become relatively large when all 13 history
    // slots are populated. Use a sufficiently large buffer and carefully
    // track remaining space to avoid truncation that would yield malformed
    // JSON on MQTT.
    char historyJson[1024];
    int pos = 0;

    // Start JSON object
    int remaining = sizeof(historyJson) - pos;
    if (remaining <= 1)
    {
      Serial.println("ERROR: historyJson buffer too small before writing header - skipping history publish");
      // Nothing written, just bail out of history publishing for this frame.
      return;
    }
    pos += snprintf(historyJson + pos, remaining, "{\"history\":[");

    // Add historical volumes and print to serial
    for (int i = 0; i < num_history; i++)
    {
      remaining = sizeof(historyJson) - pos;
      if (remaining <= 1)
      {
        Serial.println("ERROR: historyJson buffer full while writing history array - truncating");
        break;
      }
      pos += snprintf(historyJson + pos, remaining, "%s%u",
                      (i > 0 ? "," : ""), meter_data.history[i]);

      // Calculate and display monthly usage
      uint32_t usage = 0;
      if (i > 0 && meter_data.history[i] > meter_data.history[i - 1])
      {
        usage = meter_data.history[i] - meter_data.history[i - 1];
      }
      Serial.printf(" -%02d   %10u  %9u\n", num_history - i, meter_data.history[i], usage);
    }

    // Calculate current month usage (difference from most recent historical reading).
    // Declare these outside of any goto targets to avoid crossing initialisation
    // when jumping to finalize_history_json.
    uint32_t currentMonthUsage = 0;
    uint32_t currentLiters = static_cast<uint32_t>(meter_data.liters);
    if (num_history > 0 && currentLiters > meter_data.history[num_history - 1])
    {
      currentMonthUsage = currentLiters - meter_data.history[num_history - 1];
    }
    Serial.printf("  Now  %10d  %9u (current month)\n", meter_data.liters, currentMonthUsage);
    Serial.println("===================================\n");

    // Add monthly usage calculations to JSON
    remaining = sizeof(historyJson) - pos;
    if (remaining <= 1)
    {
      Serial.println("ERROR: historyJson buffer full before monthly_usage - truncating");
      // Close what we have so far and publish best-effort JSON.
      historyJson[sizeof(historyJson) - 1] = '\0';
      Serial.printf("Publishing JSON attributes (%d bytes): %s\n\n", strlen(historyJson), historyJson);
      mqtt.publish(String(MQTT_BASE_TOPIC) + "liters_attributes", historyJson, true);
      delay(5);
      Serial.printf("> Published %d months historical data (current month usage: %u L)\n",
                    num_history, currentMonthUsage);
      goto skip_history_publish;
    }
    pos += snprintf(historyJson + pos, remaining, "],\"monthly_usage\":[");
    for (int i = 0; i < num_history; i++)
    {
      uint32_t usage;
      if (i == 0)
      {
        // For oldest month, we can't calculate usage without an older baseline
        usage = 0;
      }
      else if (meter_data.history[i] > meter_data.history[i - 1])
      {
        // Calculate consumption as difference between consecutive months
        usage = meter_data.history[i] - meter_data.history[i - 1];
      }
      else
      {
        usage = 0; // Sanity check - shouldn't go backwards
      }
      remaining = sizeof(historyJson) - pos;
      if (remaining <= 1)
      {
        Serial.println("ERROR: historyJson buffer full while writing monthly_usage - truncating");
        break;
      }
      pos += snprintf(historyJson + pos, remaining, "%s%u",
                      (i > 0 ? "," : ""), usage);
    }

    remaining = sizeof(historyJson) - pos;
    if (remaining <= 1)
    {
      Serial.println("ERROR: historyJson buffer full before tail - truncating");
      historyJson[sizeof(historyJson) - 1] = '\0';
      Serial.printf("Publishing JSON attributes (%d bytes): %s\n\n", strlen(historyJson), historyJson);
      mqtt.publish(String(MQTT_BASE_TOPIC) + "liters_attributes", historyJson, true);
      delay(5);
      Serial.printf("> Published %d months historical data (current month usage: %u L)\n",
                    num_history, currentMonthUsage);
      goto skip_history_publish;
    }
    pos += snprintf(historyJson + pos, remaining,
                    "],\"current_month_usage\":%u,\"months_available\":%d}",
                    currentMonthUsage, num_history);

    // Ensure null termination even if we had to truncate early.
    historyJson[sizeof(historyJson) - 1] = '\0';

    Serial.printf("Publishing JSON attributes (%d bytes): %s\n\n", strlen(historyJson), historyJson);
    mqtt.publish(String(MQTT_BASE_TOPIC) + "liters_attributes", historyJson, true);
    delay(5);

    Serial.printf("> Published %d months historical data (current month usage: %u L)\n",
                  num_history, currentMonthUsage);
  }

