genestealer/everblu-meters-esp8266-improved/src/main.cpp
skip_history_publish:;

  snprintf(valueBuffer, sizeof(valueBuffer), "%d", meter_data.reads_counter);
  mqtt.publish(String(MQTT_BASE_TOPIC) + "counter", valueBuffer, true);
  delay(5);

  snprintf(valueBuffer, sizeof(valueBuffer), "%d", meter_data.battery_left);
  mqtt.publish(String(MQTT_BASE_TOPIC) + "battery", valueBuffer, true);
  delay(5);

  snprintf(valueBuffer, sizeof(valueBuffer), "%d", meter_data.rssi_dbm);
  mqtt.publish(String(MQTT_BASE_TOPIC) + "rssi_dbm", valueBuffer, true);
  delay(5);

  snprintf(valueBuffer, sizeof(valueBuffer), "%d", calculateMeterdBmToPercentage(meter_data.rssi_dbm));
  mqtt.publish(String(MQTT_BASE_TOPIC) + "rssi_percentage", valueBuffer, true);
  delay(5);

  snprintf(valueBuffer, sizeof(valueBuffer), "%d", meter_data.lqi);
  mqtt.publish(String(MQTT_BASE_TOPIC) + "lqi", valueBuffer, true);
  delay(5);
  mqtt.publish(String(MQTT_BASE_TOPIC) + "time_start", timeStartFormatted, true);
  delay(5);
  mqtt.publish(String(MQTT_BASE_TOPIC) + "time_end", timeEndFormatted, true);
  delay(5);
  mqtt.publish(String(MQTT_BASE_TOPIC) + "timestamp", iso8601, true); // timestamp since epoch in UTC
  delay(5);

  snprintf(valueBuffer, sizeof(valueBuffer), "%d", calculateLQIToPercentage(meter_data.lqi));
  mqtt.publish(String(MQTT_BASE_TOPIC) + "lqi_percentage", valueBuffer, true);
  delay(5);

  // Publish all data as a JSON message as well this is redundant but may be useful for some
  char json[512];
  sprintf(json, jsonTemplate, meter_data.liters, meter_data.reads_counter, meter_data.battery_left, meter_data.rssi, iso8601);
  mqtt.publish(String(MQTT_BASE_TOPIC) + "json", json, true);
  delay(5);

#if AUTO_ALIGN_READING_TIME
  // Optionally auto-align the daily scheduled reading time to the meter's wake window
  {
    int timeStart = constrain(meter_data.time_start, 0, 23);
    int timeEnd = constrain(meter_data.time_end, 0, 23);
    int window = (timeEnd - timeStart + 24) % 24; // hours in window (0 means unknown/all-day)

    if (window > 0)
    {
#if AUTO_ALIGN_USE_MIDPOINT
      int alignedHourLocal = (timeStart + (window / 2)) % 24; // midpoint (interpreted as local-offset time)
#else
      int alignedHourLocal = timeStart; // start of window (local-offset time)
#endif
      // Update resolved schedule time in LOCAL and derive UTC equivalent
      g_readHourLocal = alignedHourLocal;
      g_readMinuteLocal = DEFAULT_READING_MINUTE_UTC;
      // Simple conversion: UTC = Local - offset
      int totalLocalMin = g_readHourLocal * 60 + g_readMinuteLocal;
      int utcMin = (totalLocalMin - TIMEZONE_OFFSET_MINUTES) % (24 * 60);
      if (utcMin < 0)
        utcMin += 24 * 60;
      g_readHourUtc = utcMin / 60;
      g_readMinuteUtc = utcMin % 60;

      // Publish updated reading_time HH:MM
      char readingTimeFormatted2[6];
      snprintf(readingTimeFormatted2, sizeof(readingTimeFormatted2), "%02d:%02d", g_readHourUtc, g_readMinuteUtc);
      mqtt.publish(String(MQTT_BASE_TOPIC) + "reading_time", readingTimeFormatted2, true);
      delay(5);

      Serial.printf("> Auto-aligned reading time to %02d:%02d local-offset (%02d:%02d UTC) (window %02d-%02d local)\n",
                    g_readHourLocal, g_readMinuteLocal, g_readHourUtc, g_readMinuteUtc, timeStart, timeEnd);
    }
  }
#endif

  // Notify MQTT that active reading has ended
  mqtt.publish(String(MQTT_BASE_TOPIC) + "active_reading", "false", true);
  mqtt.publish(String(MQTT_BASE_TOPIC) + "cc1101_state", "Idle", true);
  digitalWrite(LED_BUILTIN, HIGH); // Turn off LED to indicate completion

  // Reset retry counter and cooldown on successful read
  _retry = 0;
  lastFailedAttempt = 0;
  successfulReads++;
  lastErrorMessage = "None";

  // Publish success metrics (using char buffers instead of String)
  char metricBuffer[16];

  snprintf(metricBuffer, sizeof(metricBuffer), "%lu", successfulReads);
  mqtt.publish(String(MQTT_BASE_TOPIC) + "successful_reads", metricBuffer, true);

  snprintf(metricBuffer, sizeof(metricBuffer), "%lu", totalReadAttempts);
  mqtt.publish(String(MQTT_BASE_TOPIC) + "total_attempts", metricBuffer, true);

  mqtt.publish(String(MQTT_BASE_TOPIC) + "last_error", "None", true);

  // Perform adaptive frequency tracking based on FREQEST register
  adaptiveFrequencyTracking(meter_data.freqest);

  Serial.printf("Data update complete.\n\n");
}

// Function: onScheduled
// Function: onScheduled
// Description: Schedules daily meter readings at the configured local-offset time.
void onScheduled()
{
  time_t tnow = time(nullptr);
  // Compute local-offset time by adding offset minutes to UTC epoch
  time_t tlocal = tnow + (time_t)TIMEZONE_OFFSET_MINUTES * 60;
  struct tm *ptm = gmtime(&tlocal);

  // Check if today is a valid reading day
  const bool timeMatch = (ptm->tm_hour == g_readHourLocal && ptm->tm_min == g_readMinuteLocal);

  if (isReadingDay(ptm) && timeMatch && ptm->tm_sec == 0)
  {
    // Check if we're still in cooldown period after failed attempts
    if (lastFailedAttempt > 0 && (millis() - lastFailedAttempt) < RETRY_COOLDOWN)
    {
      unsigned long remainingCooldown = (RETRY_COOLDOWN - (millis() - lastFailedAttempt)) / 1000;
      Serial.printf("Still in cooldown period. %lu seconds remaining.\n", remainingCooldown);

      char cooldownMsg[64];
      snprintf(cooldownMsg, sizeof(cooldownMsg), "Cooldown active, %lus remaining", remainingCooldown);
      mqtt.publish("everblu/cyble/status_message", cooldownMsg, true);
      mqtt.executeDelayed(500, onScheduled);
      return;
    }

    // Cooldown period is over, reset and proceed
    lastFailedAttempt = 0;

    // Call back in 23 hours
    mqtt.executeDelayed(1000 * 60 * 60 * 23, onScheduled);

    Serial.println("It is time to update data from meter :)");

    // Update data
    _retry = 0;
    onUpdateData();
    return;
  }

  // Check every 500 ms
  mqtt.executeDelayed(500, onScheduled);
}

// Supported abbreviations in MQTT discovery messages for Home Assistant
// Used to reduce the size of the JSON payload
// https://www.home-assistant.io/integrations/mqtt/#supported-abbreviations-in-mqtt-discovery-messages

